In [23]:
#importing libraries
import pandas as pd
import numpy as np

# The dataset is taken from kaggle.

In [2]:
df = pd.read_csv(r"C:\Users\Dr. J .R Junghare\Desktop\Datasets\diamonds.csv")
df.head()                                                 # The dataset consists of prices of diamonds based on the features
                                                         # The price of diamonds are given in $

,Unnamed: 0,carat,cut,color,clarity,depth,table,price,x,y,z
0,1,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43
1,2,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31
2,3,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31
3,4,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63
4,5,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75

In [5]:
data_columns = ['carat', 'price'] # We will only focus on two columns

In [6]:
df = df[data_columns].copy()

In [7]:
df.head()

   carat  price
0   0.23    326
1   0.21    326
2   0.23    327
3   0.29    334
4   0.31    335

In [15]:
df.shape    # The dataset has 53940 entries

(53940, 2)

In [16]:
df.describe() #This show statistical summary of the data

              carat         price
count  53940.000000  53940.000000
mean       0.797940   3932.799722
std        0.474011   3989.439738
min        0.200000    326.000000
25%        0.400000    950.000000
50%        0.700000   2401.000000
75%        1.040000   5324.250000
max        5.010000  18823.000000

In [8]:
max_thresold = df['price'].quantile(0.95) # 95th percentile value
max_thresold   # Anything bigger than this value will be considered as outlier

13107.099999999991

In [10]:
df[df['price']>max_thresold]  # The data shows price of diamonds bigger than max_threshold

       carat  price
24753   2.03  13109
24754   2.02  13109
24755   2.01  13109
24756   1.54  13110
24757   1.13  13111
...      ...    ...
27745   2.00  18803
27746   2.07  18804
27747   1.51  18806
27748   2.00  18818
27749   2.29  18823

[2697 rows x 2 columns]

In [11]:
min_thresold = df['price'].quantile(0.05) # 5th percentile value
min_thresold  #Any value smaller than this will be considered outliers

544.0

In [12]:
df[df['price']<min_thresold] #The data shows prices of diamonds less than min_threshold

       carat  price
0       0.23    326
1       0.21    326
2       0.23    327
3       0.29    334
4       0.31    335
...      ...    ...
50635   0.23    402
50636   0.23    402
50637   0.23    402
50638   0.23    402
50639   0.23    402

[2626 rows x 2 columns]

In [18]:
df2 = df[(df['price']<max_thresold) & (df['price']>min_thresold)]
df2.shape                                                         #removing the outliers
                                                                  # intotal we have removed 5443 outliers

(48497, 2)

In [19]:
df2.describe()

              carat         price
count  48497.000000  48497.000000
mean       0.764864   3473.794585
std        0.398958   2992.257483
min        0.230000    545.000000
25%        0.410000   1015.000000
50%        0.700000   2404.000000
75%        1.020000   4974.000000
max        3.650000  13107.000000